#ifndef __BEEP_H
#define __BEEP_H

#include "./SYSTEM/sys/sys.h"






/******************************************************************************************/
/* 引脚 定义 */

#define BEEP_GPIO_PORT                  GPIOB
#define BEEP_GPIO_PIN                   GPIO_PIN_12
#define BEEP_GPIO_CLK_ENABLE()          do{ __HAL_RCC_GPIOB_CLK_ENABLE(); }while(0)             /* PF口时钟使能 */


/******************************************************************************************/

/* LED端口定义 */

#define	BEEP														PBout(12)
/******************************************************************************************/
/******************************************************************************************/
/* 外部接口函数*/
void BEEP_init(void);                                                                            /* 初始化 */

#endif








